
/////	Предмет:
/////	Основы объектно ориентированного проектирования // UML // Паттерны проектирования

 
/* Источники информации:
1. http//UML-example
2. Youtube: ave coder
*/


// Class Work 23.08.2023 -------------------------------------------	

// UML (Unified 

//Типы диаграмм:
/*
1. Поведенчиские
	1.1 Use-case (диаграмма прецендентов)
	1.2 Activity (диаграмма поведения)
	1.3 Sequense (диаграмма последовательности)
	1.4* (диаграмма состояний)

2. Структурные
	2.1 Диаграмма классов
	2.2 Диаграмма объектов
	2.3 Диаграмма коммуникации	

3* Общая структура	

4* Общее взаимодействие

** Диаграмма компонентов


*/


// 	1.1 Use-case (диаграмма прецендентов)

/** 
1) Кто будет использовать приложение?
2) Как будет использовать?


хххххххххххххххххххххххххххх
USE_CASE DIA.jpg

Объект: крышечка 

Преценденты использования:
1) закрывать провода
2) кормушка
3) объект мены
4) стакан
5) шайба

хххххххххххххххххххххххххххх

тип объекта (сервер/администратор) зависит от использования

Акторы системы: инициируют действия системы извне


Порядок подготовки Use-case диаграмма:
1. Определить состав акторов [источник Заказчик]
2. Ориентировочный список прецендентов (способов использования) [источник Акторы/Пользователь/Заказчик]
3. Подпреценденты / Вложенные преценденты



Софт для UML проектирования:

Универсальные диаграммы:
0) creately
1) diagramms.net
Microsoft Visio

2) figma -> use-case / поведенческие диаграммы

3) staruml -> умеет в диаграммы классов / умеет генерировать код из диаграмм
4) uml-designer

--- 2007 год ---
5) rationalrose 
6) rationaldesigner

*/


//Task 1
void Task_1()
{

}
//Task 2
void Task_2()
{
	
}
//Task 3
void Task_3()
{

}

// MAIN ------- MAIN ------- MAIN ------- MAIN ------- MAIN --------
int main()
{		
	
Task_1();
Task_2();
Task_3();

//system("pause");	
}


